import React, { useState, useEffect } from "react";
import siteData from "./api/api";
import { Helmet } from "react-helmet";
import Head from "next/head";
import Link from "next/link";
import Menu from "../components/directory_menu";
import Slider from "../components/directory_slider";
import ActivistsRow from "../components/directory_activistsRow";
import Footer from "../components/directory_footer";
import Banner from "../components/directory_banner";
import Box from "../components/directory_productRow/box";
import BlogRow from "../components/directory_blogRow";
import CenterRow from "../components/directory_centerRow";
import CategoresRow from "../components/directory_categoresRow";
export async function getStaticProps() {
  const response = await fetch(siteData.url + "/categories");
  const category = await response.json();
  const response2 = await fetch(siteData.url + "/states");
  const states = await response2.json();
  const response3 = await fetch(siteData.url + "/blogs");
  const blogs = await response3.json();
  const response4 = await fetch(siteData.url + "/booths");
  const booths = await response4.json();
  const response5 = await fetch(siteData.url + "/products");
  const products = await response5.json();

  return {
    props: {
      category,
      states,
      blogs,
      booths,
      products,
    },
  };
}
const Index = ({ category, states, blogs, booths, products }) => {
  const page = {
    title: "صفحه اصلی",
  };

  const slider = [
    {
      alert: "با شرکت در پخش زنده شرکت ها از آخرین محصولات آنها مطلع گردید",
      alert_link: "/stream",
      tagline: "",
      title: "مرجع تامین کننده های ایران",
      link: "#",
      img: "./img.jpg",
      btn_title: "بیشتر ...",
      video_mp4: "./file/video2.mp4",
      video_ogg: "./file/video2.ogg",
    },
  ];
  const product = [
    {
      id: 1,
      title: "چانه گرد کن مخروطی تمام اتوماتیک حرفه ای",
      img: "/file/110732667.webp",
      price: "2000000",
      lastPrice: null,
      category: {
        id: 14,
        title: "تجهیزات و ماشین آلات صنعتی",
        icon: `<svg version="1.1" id="Layer_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" 
        viewBox="0 0 384.154 384.154" xml:space="preserve">
     <g id="XMLID_999_">
       <g>
         <g>
           <path d="M334.154,259.41h-17.077v-37.863h-60v37.863h-49.25v-37.863h-60v37.863h-52.75V66.744h52.359
             c3.171,9.612,10.779,17.22,20.391,20.391v27.472h-8.664l-0.768,31.698l-34.104,22.839l22.054,31.178l16.328-11.551
             l-10.205-14.426l25.358-16.981l25.358,16.981l-10.205,14.426l16.328,11.551l22.055-31.178l-34.104-22.839l-0.768-31.698h-8.664
             V87.135c12.761-4.21,22-16.239,22-30.391c0-17.645-14.355-32-32-32c-14.153,0-26.181,9.239-30.391,22H95.077H72.494H30.077
             v216.818C12.395,271.276,0,288.919,0,309.41c0,27.57,22.43,50,50,50h284.154c27.57,0,50-22.43,50-50
             S361.725,259.41,334.154,259.41z M177.827,44.744c6.617,0,12,5.383,12,12s-5.383,12-12,12s-12-5.383-12-12
             S171.21,44.744,177.827,44.744z M277.077,241.547h20v17.863h-20V241.547z M167.827,241.547h20v17.863h-20V241.547z
              M50.077,66.744h22.417h2.583V259.41h-25V66.744z M334.154,339.41H50c-16.542,0-30-13.458-30-30s13.458-30,30-30h284.154
             c16.542,0,30,13.458,30,30S350.696,339.41,334.154,339.41z"/>
           <rect x="53.827" y="299.41" width="35.333" height="20"/>
           <rect x="134.216" y="299.41" width="35.333" height="20"/>
           <rect x="214.604" y="299.41" width="35.334" height="20"/>
           <rect x="294.994" y="299.41" width="35.333" height="20"/>
         </g>
       </g>
     </g>
     </svg>`,
        url: "categories",
        img: "/file/download (2).jfif",
        parent: null,
        slider: 1,
        home: null,
      },
      brand: {
        name: "شرکت پاک اندیشان",
        logo: "./file/kala.jfif",
        link: "/company/1",
      },
      min: 2,
    },
    {
      id: 1,
      title: "اسیاب ۰۲۱ و ماشین اسپرسو اسکاسو",
      img: "/file/img_35777_1.jpg",
      price: "40000000",
      lastPrice: null,
      category: {
        id: 14,
        title: "تجهیزات و ماشین آلات صنعتی",
        icon: `<svg version="1.1" id="Layer_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink"  viewBox="0 0 384.154 384.154" xml:space="preserve"><g id="XMLID_999_"><g><g><path d="M334.154,259.41h-17.077v-37.863h-60v37.863h-49.25v-37.863h-60v37.863h-52.75V66.744h52.359 c3.171,9.612,10.779,17.22,20.391,20.391v27.472h-8.664l-0.768,31.698l-34.104,22.839l22.054,31.178l16.328-11.551 l-10.205-14.426l25.358-16.981l25.358,16.981l-10.205,14.426l16.328,11.551l22.055-31.178l-34.104-22.839l-0.768-31.698h-8.664 V87.135c12.761-4.21,22-16.239,22-30.391c0-17.645-14.355-32-32-32c-14.153,0-26.181,9.239-30.391,22H95.077H72.494H30.077 v216.818C12.395,271.276,0,288.919,0,309.41c0,27.57,22.43,50,50,50h284.154c27.57,0,50-22.43,50-50 S361.725,259.41,334.154,259.41z M177.827,44.744c6.617,0,12,5.383,12,12s-5.383,12-12,12s-12-5.383-12-12 S171.21,44.744,177.827,44.744z M277.077,241.547h20v17.863h-20V241.547z M167.827,241.547h20v17.863h-20V241.547z M50.077,66.744h22.417h2.583V259.41h-25V66.744z M334.154,339.41H50c-16.542,0-30-13.458-30-30s13.458-30,30-30h284.154 c16.542,0,30,13.458,30,30S350.696,339.41,334.154,339.41z"/><rect x="53.827" y="299.41" width="35.333" height="20"/><rect x="134.216" y="299.41" width="35.333" height="20"/><rect x="214.604" y="299.41" width="35.334" height="20"/><rect x="294.994" y="299.41" width="35.333" height="20"/></g></g></g></svg>`,
        url: "categories",
        img: "/file/download (2).jfif",
        parent: null,
        slider: 1,
        home: null,
      },
      brand: {
        name: "کالای صنعتی محمودی",
        logo: "./file/download.jfif",
        link: "/company/1",
      },
      min: 2,
    },
    {
      id: 1,
      title: "پنل خورشیدی المانی ",
      img: "/file/img_35761_1.jpg",
      price: "550000",
      lastPrice: "500000",
      category: {
        id: 14,
        title: "تجهیزات و ماشین آلات صنعتی",
        icon: `<svg version="1.1" id="Layer_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink"  viewBox="0 0 384.154 384.154" xml:space="preserve"><g id="XMLID_999_"><g><g><path d="M334.154,259.41h-17.077v-37.863h-60v37.863h-49.25v-37.863h-60v37.863h-52.75V66.744h52.359 c3.171,9.612,10.779,17.22,20.391,20.391v27.472h-8.664l-0.768,31.698l-34.104,22.839l22.054,31.178l16.328-11.551 l-10.205-14.426l25.358-16.981l25.358,16.981l-10.205,14.426l16.328,11.551l22.055-31.178l-34.104-22.839l-0.768-31.698h-8.664 V87.135c12.761-4.21,22-16.239,22-30.391c0-17.645-14.355-32-32-32c-14.153,0-26.181,9.239-30.391,22H95.077H72.494H30.077 v216.818C12.395,271.276,0,288.919,0,309.41c0,27.57,22.43,50,50,50h284.154c27.57,0,50-22.43,50-50 S361.725,259.41,334.154,259.41z M177.827,44.744c6.617,0,12,5.383,12,12s-5.383,12-12,12s-12-5.383-12-12 S171.21,44.744,177.827,44.744z M277.077,241.547h20v17.863h-20V241.547z M167.827,241.547h20v17.863h-20V241.547z M50.077,66.744h22.417h2.583V259.41h-25V66.744z M334.154,339.41H50c-16.542,0-30-13.458-30-30s13.458-30,30-30h284.154 c16.542,0,30,13.458,30,30S350.696,339.41,334.154,339.41z"/><rect x="53.827" y="299.41" width="35.333" height="20"/><rect x="134.216" y="299.41" width="35.333" height="20"/><rect x="214.604" y="299.41" width="35.334" height="20"/><rect x="294.994" y="299.41" width="35.333" height="20"/></g></g></g></svg>`,
        url: "categories",
        img: "/file/download (2).jfif",
        parent: null,
        slider: 1,
        home: null,
      },
      brand: {
        name: "کالای صنعتی محمودی",
        logo: "./file/download1.jfif",
        link: "/company/1",
      },
      min: 1,
    },
    {
      id: 1,
      title: "یو پی اس ذخیره برق فاراتل UPS (اداری ، آزمایشگاه)",
      img: "/file/img_34894_1.jpg",
      price: "36360000",
      lastPrice: null,
      category: {
        id: 14,
        title: "تجهیزات و ماشین آلات صنعتی",
        icon: `<svg version="1.1" id="Layer_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink"  viewBox="0 0 384.154 384.154" xml:space="preserve"><g id="XMLID_999_"><g><g><path d="M334.154,259.41h-17.077v-37.863h-60v37.863h-49.25v-37.863h-60v37.863h-52.75V66.744h52.359 c3.171,9.612,10.779,17.22,20.391,20.391v27.472h-8.664l-0.768,31.698l-34.104,22.839l22.054,31.178l16.328-11.551 l-10.205-14.426l25.358-16.981l25.358,16.981l-10.205,14.426l16.328,11.551l22.055-31.178l-34.104-22.839l-0.768-31.698h-8.664 V87.135c12.761-4.21,22-16.239,22-30.391c0-17.645-14.355-32-32-32c-14.153,0-26.181,9.239-30.391,22H95.077H72.494H30.077 v216.818C12.395,271.276,0,288.919,0,309.41c0,27.57,22.43,50,50,50h284.154c27.57,0,50-22.43,50-50 S361.725,259.41,334.154,259.41z M177.827,44.744c6.617,0,12,5.383,12,12s-5.383,12-12,12s-12-5.383-12-12 S171.21,44.744,177.827,44.744z M277.077,241.547h20v17.863h-20V241.547z M167.827,241.547h20v17.863h-20V241.547z M50.077,66.744h22.417h2.583V259.41h-25V66.744z M334.154,339.41H50c-16.542,0-30-13.458-30-30s13.458-30,30-30h284.154 c16.542,0,30,13.458,30,30S350.696,339.41,334.154,339.41z"/><rect x="53.827" y="299.41" width="35.333" height="20"/><rect x="134.216" y="299.41" width="35.333" height="20"/><rect x="214.604" y="299.41" width="35.334" height="20"/><rect x="294.994" y="299.41" width="35.333" height="20"/></g></g></g></svg>`,
        url: "categories",
        img: "/file/download (2).jfif",
        parent: null,
        slider: 1,
        home: null,
      },
      brand: {
        name: "کالای صنعتی محمودی",
        logo: "./file/download.jfif",
        link: "/company/1",
      },
      min: 1,
    },
    {
      id: 1,
      title: "الکتروموتور چینی سه فاز و تکفاز گیربکس حلزونی",
      img: "/file/img_34427_1.jpg",
      price: "100000",
      lastPrice: "950000",
      category: {
        id: 14,
        title: "تجهیزات و ماشین آلات صنعتی",
        icon: `<svg version="1.1" id="Layer_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink"  viewBox="0 0 384.154 384.154" xml:space="preserve"><g id="XMLID_999_"><g><g><path d="M334.154,259.41h-17.077v-37.863h-60v37.863h-49.25v-37.863h-60v37.863h-52.75V66.744h52.359 c3.171,9.612,10.779,17.22,20.391,20.391v27.472h-8.664l-0.768,31.698l-34.104,22.839l22.054,31.178l16.328-11.551 l-10.205-14.426l25.358-16.981l25.358,16.981l-10.205,14.426l16.328,11.551l22.055-31.178l-34.104-22.839l-0.768-31.698h-8.664 V87.135c12.761-4.21,22-16.239,22-30.391c0-17.645-14.355-32-32-32c-14.153,0-26.181,9.239-30.391,22H95.077H72.494H30.077 v216.818C12.395,271.276,0,288.919,0,309.41c0,27.57,22.43,50,50,50h284.154c27.57,0,50-22.43,50-50 S361.725,259.41,334.154,259.41z M177.827,44.744c6.617,0,12,5.383,12,12s-5.383,12-12,12s-12-5.383-12-12 S171.21,44.744,177.827,44.744z M277.077,241.547h20v17.863h-20V241.547z M167.827,241.547h20v17.863h-20V241.547z M50.077,66.744h22.417h2.583V259.41h-25V66.744z M334.154,339.41H50c-16.542,0-30-13.458-30-30s13.458-30,30-30h284.154 c16.542,0,30,13.458,30,30S350.696,339.41,334.154,339.41z"/><rect x="53.827" y="299.41" width="35.333" height="20"/><rect x="134.216" y="299.41" width="35.333" height="20"/><rect x="214.604" y="299.41" width="35.334" height="20"/><rect x="294.994" y="299.41" width="35.333" height="20"/></g></g></g></svg>`,
        url: "categories",
        img: "/file/download (2).jfif",
        parent: null,
        slider: 1,
        home: null,
      },
      brand: {
        name: "کالای صنعتی محمودی",
        logo: "./file/download.jfif",
        link: "/company/1",
      },
      min: 1,
    },
    {
      id: 1,
      title: "الکتروموتور چینی سه فاز و تکفاز گیربکس حلزونی ",
      img: "/file/img_34441_1.jpg",
      price: "2000000",
      category: {
        id: 14,
        title: "تجهیزات و ماشین آلات صنعتی",
        icon: `<svg version="1.1" id="Layer_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink"  viewBox="0 0 384.154 384.154" xml:space="preserve"><g id="XMLID_999_"><g><g><path d="M334.154,259.41h-17.077v-37.863h-60v37.863h-49.25v-37.863h-60v37.863h-52.75V66.744h52.359 c3.171,9.612,10.779,17.22,20.391,20.391v27.472h-8.664l-0.768,31.698l-34.104,22.839l22.054,31.178l16.328-11.551 l-10.205-14.426l25.358-16.981l25.358,16.981l-10.205,14.426l16.328,11.551l22.055-31.178l-34.104-22.839l-0.768-31.698h-8.664 V87.135c12.761-4.21,22-16.239,22-30.391c0-17.645-14.355-32-32-32c-14.153,0-26.181,9.239-30.391,22H95.077H72.494H30.077 v216.818C12.395,271.276,0,288.919,0,309.41c0,27.57,22.43,50,50,50h284.154c27.57,0,50-22.43,50-50 S361.725,259.41,334.154,259.41z M177.827,44.744c6.617,0,12,5.383,12,12s-5.383,12-12,12s-12-5.383-12-12 S171.21,44.744,177.827,44.744z M277.077,241.547h20v17.863h-20V241.547z M167.827,241.547h20v17.863h-20V241.547z M50.077,66.744h22.417h2.583V259.41h-25V66.744z M334.154,339.41H50c-16.542,0-30-13.458-30-30s13.458-30,30-30h284.154 c16.542,0,30,13.458,30,30S350.696,339.41,334.154,339.41z"/><rect x="53.827" y="299.41" width="35.333" height="20"/><rect x="134.216" y="299.41" width="35.333" height="20"/><rect x="214.604" y="299.41" width="35.334" height="20"/><rect x="294.994" y="299.41" width="35.333" height="20"/></g></g></g></svg>`,
        url: "categories",
        img: "/file/download (2).jfif",
        parent: null,
        slider: 1,
        home: null,
      },
      brand: {
        name: "کالای صنعتی محمودی",
        logo: "./file/download1.jfif",
        link: "/company/1",
      },
      min: 2,
    },

    {
      id: 1,
      title: "کوره هوای گرم",
      img: "/file/img_35734_1.jpg",
      price: "1520000",
      category: {
        id: 14,
        title: "تجهیزات و ماشین آلات صنعتی",
        icon: `<svg version="1.1" id="Layer_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink"  viewBox="0 0 384.154 384.154" xml:space="preserve"><g id="XMLID_999_"><g><g><path d="M334.154,259.41h-17.077v-37.863h-60v37.863h-49.25v-37.863h-60v37.863h-52.75V66.744h52.359 c3.171,9.612,10.779,17.22,20.391,20.391v27.472h-8.664l-0.768,31.698l-34.104,22.839l22.054,31.178l16.328-11.551 l-10.205-14.426l25.358-16.981l25.358,16.981l-10.205,14.426l16.328,11.551l22.055-31.178l-34.104-22.839l-0.768-31.698h-8.664 V87.135c12.761-4.21,22-16.239,22-30.391c0-17.645-14.355-32-32-32c-14.153,0-26.181,9.239-30.391,22H95.077H72.494H30.077 v216.818C12.395,271.276,0,288.919,0,309.41c0,27.57,22.43,50,50,50h284.154c27.57,0,50-22.43,50-50 S361.725,259.41,334.154,259.41z M177.827,44.744c6.617,0,12,5.383,12,12s-5.383,12-12,12s-12-5.383-12-12 S171.21,44.744,177.827,44.744z M277.077,241.547h20v17.863h-20V241.547z M167.827,241.547h20v17.863h-20V241.547z M50.077,66.744h22.417h2.583V259.41h-25V66.744z M334.154,339.41H50c-16.542,0-30-13.458-30-30s13.458-30,30-30h284.154 c16.542,0,30,13.458,30,30S350.696,339.41,334.154,339.41z"/><rect x="53.827" y="299.41" width="35.333" height="20"/><rect x="134.216" y="299.41" width="35.333" height="20"/><rect x="214.604" y="299.41" width="35.334" height="20"/><rect x="294.994" y="299.41" width="35.333" height="20"/></g></g></g></svg>`,
        url: "categories",
        img: "/file/download (2).jfif",
        parent: null,
        slider: 1,
        home: null,
      },
      brand: {
        name: "کالای صنعتی محمودی",
        logo: "./file/download.jfif",
        link: "/company/1",
      },
      min: 10,
    },
    {
      id: 1,
      title: "گیوتین قیچی خم کن",
      img: "/file/img_35360_1.jpg",
      price: "175000000",
      category: {
        id: 14,
        title: "تجهیزات و ماشین آلات صنعتی",
        icon: `<svg version="1.1" id="Layer_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink"  viewBox="0 0 384.154 384.154" xml:space="preserve"><g id="XMLID_999_"><g><g><path d="M334.154,259.41h-17.077v-37.863h-60v37.863h-49.25v-37.863h-60v37.863h-52.75V66.744h52.359 c3.171,9.612,10.779,17.22,20.391,20.391v27.472h-8.664l-0.768,31.698l-34.104,22.839l22.054,31.178l16.328-11.551 l-10.205-14.426l25.358-16.981l25.358,16.981l-10.205,14.426l16.328,11.551l22.055-31.178l-34.104-22.839l-0.768-31.698h-8.664 V87.135c12.761-4.21,22-16.239,22-30.391c0-17.645-14.355-32-32-32c-14.153,0-26.181,9.239-30.391,22H95.077H72.494H30.077 v216.818C12.395,271.276,0,288.919,0,309.41c0,27.57,22.43,50,50,50h284.154c27.57,0,50-22.43,50-50 S361.725,259.41,334.154,259.41z M177.827,44.744c6.617,0,12,5.383,12,12s-5.383,12-12,12s-12-5.383-12-12 S171.21,44.744,177.827,44.744z M277.077,241.547h20v17.863h-20V241.547z M167.827,241.547h20v17.863h-20V241.547z M50.077,66.744h22.417h2.583V259.41h-25V66.744z M334.154,339.41H50c-16.542,0-30-13.458-30-30s13.458-30,30-30h284.154 c16.542,0,30,13.458,30,30S350.696,339.41,334.154,339.41z"/><rect x="53.827" y="299.41" width="35.333" height="20"/><rect x="134.216" y="299.41" width="35.333" height="20"/><rect x="214.604" y="299.41" width="35.334" height="20"/><rect x="294.994" y="299.41" width="35.333" height="20"/></g></g></g></svg>`,
        url: "categories",
        img: "/file/download (2).jfif",
        parent: null,
        slider: 1,
        home: null,
      },
      brand: {
        name: "کالای صنعتی محمودی",
        logo: "./file/download.jfif",
        link: "/company/1",
      },
      min: 1,
    },
  ];
  const banner = [
    {
      img: "./file/Schon-Lavender-Extract-Relaxing-Body-Wash.png",
      link: "/",
    },
    {
      img: "./file/Schon-Hydrating-With-Avocado-Extract-Shampoo.png",
      link: "/",
    },
    {
      img: "./file/Schon-Hand-And-Face-Cream..png",
      link: "/",
    },
    {
      img: "./file/Schon-Daily-Defense-Foundation.png",
      link: "/",
    },
  ];
  const activist = [
    {
      id: 1,
      title: "کالای صنعتی محمودی",
      img: "/file/aTi2DgJ9XEe9AZIhSswNpw-001.jpg",
      category: {
        id: 14,
        title: "تجهیزات و ماشین آلات صنعتی",
        icon: `<svg version="1.1" id="Layer_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink"  viewBox="0 0 384.154 384.154" xml:space="preserve"><g id="XMLID_999_"><g><g><path d="M334.154,259.41h-17.077v-37.863h-60v37.863h-49.25v-37.863h-60v37.863h-52.75V66.744h52.359 c3.171,9.612,10.779,17.22,20.391,20.391v27.472h-8.664l-0.768,31.698l-34.104,22.839l22.054,31.178l16.328-11.551 l-10.205-14.426l25.358-16.981l25.358,16.981l-10.205,14.426l16.328,11.551l22.055-31.178l-34.104-22.839l-0.768-31.698h-8.664 V87.135c12.761-4.21,22-16.239,22-30.391c0-17.645-14.355-32-32-32c-14.153,0-26.181,9.239-30.391,22H95.077H72.494H30.077 v216.818C12.395,271.276,0,288.919,0,309.41c0,27.57,22.43,50,50,50h284.154c27.57,0,50-22.43,50-50 S361.725,259.41,334.154,259.41z M177.827,44.744c6.617,0,12,5.383,12,12s-5.383,12-12,12s-12-5.383-12-12 S171.21,44.744,177.827,44.744z M277.077,241.547h20v17.863h-20V241.547z M167.827,241.547h20v17.863h-20V241.547z M50.077,66.744h22.417h2.583V259.41h-25V66.744z M334.154,339.41H50c-16.542,0-30-13.458-30-30s13.458-30,30-30h284.154 c16.542,0,30,13.458,30,30S350.696,339.41,334.154,339.41z"/><rect x="53.827" y="299.41" width="35.333" height="20"/><rect x="134.216" y="299.41" width="35.333" height="20"/><rect x="214.604" y="299.41" width="35.334" height="20"/><rect x="294.994" y="299.41" width="35.333" height="20"/></g></g></g></svg>`,
        url: "categories",
        img: "/file/download (2).jfif",
        parent: null,
        slider: 1,
        home: null,
      },
      logo: "./file/download.jfif",
      phone: "09146003002",
      addres: "موقعیت مکانی فروشگاه",
      status: 1,
      product: [
        {
          id: 1,
          title: "یو پی اس ذخیره برق فاراتل UPS (اداری ، آزمایشگاه)",
          img: "/file/img_34894_1.jpg",
          price: "36360000",
          lastPrice: null,
          category: {
            id: 14,
            title: "تجهیزات و ماشین آلات صنعتی",
            icon: `<svg version="1.1" id="Layer_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink"  viewBox="0 0 384.154 384.154" xml:space="preserve"><g id="XMLID_999_"><g><g><path d="M334.154,259.41h-17.077v-37.863h-60v37.863h-49.25v-37.863h-60v37.863h-52.75V66.744h52.359 c3.171,9.612,10.779,17.22,20.391,20.391v27.472h-8.664l-0.768,31.698l-34.104,22.839l22.054,31.178l16.328-11.551 l-10.205-14.426l25.358-16.981l25.358,16.981l-10.205,14.426l16.328,11.551l22.055-31.178l-34.104-22.839l-0.768-31.698h-8.664 V87.135c12.761-4.21,22-16.239,22-30.391c0-17.645-14.355-32-32-32c-14.153,0-26.181,9.239-30.391,22H95.077H72.494H30.077 v216.818C12.395,271.276,0,288.919,0,309.41c0,27.57,22.43,50,50,50h284.154c27.57,0,50-22.43,50-50 S361.725,259.41,334.154,259.41z M177.827,44.744c6.617,0,12,5.383,12,12s-5.383,12-12,12s-12-5.383-12-12 S171.21,44.744,177.827,44.744z M277.077,241.547h20v17.863h-20V241.547z M167.827,241.547h20v17.863h-20V241.547z M50.077,66.744h22.417h2.583V259.41h-25V66.744z M334.154,339.41H50c-16.542,0-30-13.458-30-30s13.458-30,30-30h284.154 c16.542,0,30,13.458,30,30S350.696,339.41,334.154,339.41z"/><rect x="53.827" y="299.41" width="35.333" height="20"/><rect x="134.216" y="299.41" width="35.333" height="20"/><rect x="214.604" y="299.41" width="35.334" height="20"/><rect x="294.994" y="299.41" width="35.333" height="20"/></g></g></g></svg>`,
            url: "categories",
            img: "/file/download (2).jfif",
            parent: null,
            slider: 1,
            home: null,
          },
          brand: {
            name: "کالای صنعتی محمودی",
            logo: "./file/download.jfif",
            link: "/company/1",
          },
          min: 1,
        },
        {
          id: 1,
          title: "الکتروموتور چینی سه فاز و تکفاز گیربکس حلزونی",
          img: "/file/img_34427_1.jpg",
          price: "100000",
          lastPrice: "950000",
          category: {
            id: 14,
            title: "تجهیزات و ماشین آلات صنعتی",
            icon: `<svg version="1.1" id="Layer_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink"  viewBox="0 0 384.154 384.154" xml:space="preserve"><g id="XMLID_999_"><g><g><path d="M334.154,259.41h-17.077v-37.863h-60v37.863h-49.25v-37.863h-60v37.863h-52.75V66.744h52.359 c3.171,9.612,10.779,17.22,20.391,20.391v27.472h-8.664l-0.768,31.698l-34.104,22.839l22.054,31.178l16.328-11.551 l-10.205-14.426l25.358-16.981l25.358,16.981l-10.205,14.426l16.328,11.551l22.055-31.178l-34.104-22.839l-0.768-31.698h-8.664 V87.135c12.761-4.21,22-16.239,22-30.391c0-17.645-14.355-32-32-32c-14.153,0-26.181,9.239-30.391,22H95.077H72.494H30.077 v216.818C12.395,271.276,0,288.919,0,309.41c0,27.57,22.43,50,50,50h284.154c27.57,0,50-22.43,50-50 S361.725,259.41,334.154,259.41z M177.827,44.744c6.617,0,12,5.383,12,12s-5.383,12-12,12s-12-5.383-12-12 S171.21,44.744,177.827,44.744z M277.077,241.547h20v17.863h-20V241.547z M167.827,241.547h20v17.863h-20V241.547z M50.077,66.744h22.417h2.583V259.41h-25V66.744z M334.154,339.41H50c-16.542,0-30-13.458-30-30s13.458-30,30-30h284.154 c16.542,0,30,13.458,30,30S350.696,339.41,334.154,339.41z"/><rect x="53.827" y="299.41" width="35.333" height="20"/><rect x="134.216" y="299.41" width="35.333" height="20"/><rect x="214.604" y="299.41" width="35.334" height="20"/><rect x="294.994" y="299.41" width="35.333" height="20"/></g></g></g></svg>`,
            url: "categories",
            img: "/file/download (2).jfif",
            parent: null,
            slider: 1,
            home: null,
          },
          brand: {
            name: "کالای صنعتی محمودی",
            logo: "./file/download.jfif",
            link: "/company/1",
          },
          min: 1,
        },
        {
          id: 1,
          title: "الکتروموتور چینی سه فاز و تکفاز گیربکس حلزونی ",
          img: "/file/img_34441_1.jpg",
          price: "2000000",
          category: {
            id: 14,
            title: "تجهیزات و ماشین آلات صنعتی",
            icon: `<svg version="1.1" id="Layer_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink"  viewBox="0 0 384.154 384.154" xml:space="preserve"><g id="XMLID_999_"><g><g><path d="M334.154,259.41h-17.077v-37.863h-60v37.863h-49.25v-37.863h-60v37.863h-52.75V66.744h52.359 c3.171,9.612,10.779,17.22,20.391,20.391v27.472h-8.664l-0.768,31.698l-34.104,22.839l22.054,31.178l16.328-11.551 l-10.205-14.426l25.358-16.981l25.358,16.981l-10.205,14.426l16.328,11.551l22.055-31.178l-34.104-22.839l-0.768-31.698h-8.664 V87.135c12.761-4.21,22-16.239,22-30.391c0-17.645-14.355-32-32-32c-14.153,0-26.181,9.239-30.391,22H95.077H72.494H30.077 v216.818C12.395,271.276,0,288.919,0,309.41c0,27.57,22.43,50,50,50h284.154c27.57,0,50-22.43,50-50 S361.725,259.41,334.154,259.41z M177.827,44.744c6.617,0,12,5.383,12,12s-5.383,12-12,12s-12-5.383-12-12 S171.21,44.744,177.827,44.744z M277.077,241.547h20v17.863h-20V241.547z M167.827,241.547h20v17.863h-20V241.547z M50.077,66.744h22.417h2.583V259.41h-25V66.744z M334.154,339.41H50c-16.542,0-30-13.458-30-30s13.458-30,30-30h284.154 c16.542,0,30,13.458,30,30S350.696,339.41,334.154,339.41z"/><rect x="53.827" y="299.41" width="35.333" height="20"/><rect x="134.216" y="299.41" width="35.333" height="20"/><rect x="214.604" y="299.41" width="35.334" height="20"/><rect x="294.994" y="299.41" width="35.333" height="20"/></g></g></g></svg>`,
            url: "categories",
            img: "/file/download (2).jfif",
            parent: null,
            slider: 1,
            home: null,
          },
          brand: {
            name: "کالای صنعتی محمودی",
            logo: "./file/download1.jfif",
            link: "/company/1",
          },
          min: 2,
        },
      ],
    },
    {
      id: 1,
      title: "کالای صنعت ایران",
      img: "/file/kalasanaat.jpg",
      category: {
        id: 14,
        title: "تجهیزات و ماشین آلات صنعتی",
        icon: `<svg version="1.1" id="Layer_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink"  viewBox="0 0 384.154 384.154" xml:space="preserve"><g id="XMLID_999_"><g><g><path d="M334.154,259.41h-17.077v-37.863h-60v37.863h-49.25v-37.863h-60v37.863h-52.75V66.744h52.359 c3.171,9.612,10.779,17.22,20.391,20.391v27.472h-8.664l-0.768,31.698l-34.104,22.839l22.054,31.178l16.328-11.551 l-10.205-14.426l25.358-16.981l25.358,16.981l-10.205,14.426l16.328,11.551l22.055-31.178l-34.104-22.839l-0.768-31.698h-8.664 V87.135c12.761-4.21,22-16.239,22-30.391c0-17.645-14.355-32-32-32c-14.153,0-26.181,9.239-30.391,22H95.077H72.494H30.077 v216.818C12.395,271.276,0,288.919,0,309.41c0,27.57,22.43,50,50,50h284.154c27.57,0,50-22.43,50-50 S361.725,259.41,334.154,259.41z M177.827,44.744c6.617,0,12,5.383,12,12s-5.383,12-12,12s-12-5.383-12-12 S171.21,44.744,177.827,44.744z M277.077,241.547h20v17.863h-20V241.547z M167.827,241.547h20v17.863h-20V241.547z M50.077,66.744h22.417h2.583V259.41h-25V66.744z M334.154,339.41H50c-16.542,0-30-13.458-30-30s13.458-30,30-30h284.154 c16.542,0,30,13.458,30,30S350.696,339.41,334.154,339.41z"/><rect x="53.827" y="299.41" width="35.333" height="20"/><rect x="134.216" y="299.41" width="35.333" height="20"/><rect x="214.604" y="299.41" width="35.334" height="20"/><rect x="294.994" y="299.41" width="35.333" height="20"/></g></g></g></svg>`,
        url: "categories",
        img: "/file/download (2).jfif",
        parent: null,
        slider: 1,
        home: null,
      },
      logo: "./file/kala.jfif",
      phone: "09146003002",
      addres: "موقعیت مکانی فروشگاه",
      status: 0,
      product: [
        {
          id: 1,
          title: "الکتروموتور چینی سه فاز و تکفاز گیربکس حلزونی ",
          img: "/file/img_34441_1.jpg",
          price: "2000000",
          category: {
            id: 14,
            title: "تجهیزات و ماشین آلات صنعتی",
            icon: `<svg version="1.1" id="Layer_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink"  viewBox="0 0 384.154 384.154" xml:space="preserve"><g id="XMLID_999_"><g><g><path d="M334.154,259.41h-17.077v-37.863h-60v37.863h-49.25v-37.863h-60v37.863h-52.75V66.744h52.359 c3.171,9.612,10.779,17.22,20.391,20.391v27.472h-8.664l-0.768,31.698l-34.104,22.839l22.054,31.178l16.328-11.551 l-10.205-14.426l25.358-16.981l25.358,16.981l-10.205,14.426l16.328,11.551l22.055-31.178l-34.104-22.839l-0.768-31.698h-8.664 V87.135c12.761-4.21,22-16.239,22-30.391c0-17.645-14.355-32-32-32c-14.153,0-26.181,9.239-30.391,22H95.077H72.494H30.077 v216.818C12.395,271.276,0,288.919,0,309.41c0,27.57,22.43,50,50,50h284.154c27.57,0,50-22.43,50-50 S361.725,259.41,334.154,259.41z M177.827,44.744c6.617,0,12,5.383,12,12s-5.383,12-12,12s-12-5.383-12-12 S171.21,44.744,177.827,44.744z M277.077,241.547h20v17.863h-20V241.547z M167.827,241.547h20v17.863h-20V241.547z M50.077,66.744h22.417h2.583V259.41h-25V66.744z M334.154,339.41H50c-16.542,0-30-13.458-30-30s13.458-30,30-30h284.154 c16.542,0,30,13.458,30,30S350.696,339.41,334.154,339.41z"/><rect x="53.827" y="299.41" width="35.333" height="20"/><rect x="134.216" y="299.41" width="35.333" height="20"/><rect x="214.604" y="299.41" width="35.334" height="20"/><rect x="294.994" y="299.41" width="35.333" height="20"/></g></g></g></svg>`,
            url: "categories",
            img: "/file/download (2).jfif",
            parent: null,
            slider: 1,
            home: null,
          },
          brand: {
            name: "کالای صنعتی محمودی",
            logo: "./file/download1.jfif",
            link: "/company/1",
          },
          min: 2,
        },

        {
          id: 1,
          title: "کوره هوای گرم",
          img: "/file/img_35734_1.jpg",
          price: "1520000",
          category: {
            id: 14,
            title: "تجهیزات و ماشین آلات صنعتی",
            icon: `<svg version="1.1" id="Layer_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink"  viewBox="0 0 384.154 384.154" xml:space="preserve"><g id="XMLID_999_"><g><g><path d="M334.154,259.41h-17.077v-37.863h-60v37.863h-49.25v-37.863h-60v37.863h-52.75V66.744h52.359 c3.171,9.612,10.779,17.22,20.391,20.391v27.472h-8.664l-0.768,31.698l-34.104,22.839l22.054,31.178l16.328-11.551 l-10.205-14.426l25.358-16.981l25.358,16.981l-10.205,14.426l16.328,11.551l22.055-31.178l-34.104-22.839l-0.768-31.698h-8.664 V87.135c12.761-4.21,22-16.239,22-30.391c0-17.645-14.355-32-32-32c-14.153,0-26.181,9.239-30.391,22H95.077H72.494H30.077 v216.818C12.395,271.276,0,288.919,0,309.41c0,27.57,22.43,50,50,50h284.154c27.57,0,50-22.43,50-50 S361.725,259.41,334.154,259.41z M177.827,44.744c6.617,0,12,5.383,12,12s-5.383,12-12,12s-12-5.383-12-12 S171.21,44.744,177.827,44.744z M277.077,241.547h20v17.863h-20V241.547z M167.827,241.547h20v17.863h-20V241.547z M50.077,66.744h22.417h2.583V259.41h-25V66.744z M334.154,339.41H50c-16.542,0-30-13.458-30-30s13.458-30,30-30h284.154 c16.542,0,30,13.458,30,30S350.696,339.41,334.154,339.41z"/><rect x="53.827" y="299.41" width="35.333" height="20"/><rect x="134.216" y="299.41" width="35.333" height="20"/><rect x="214.604" y="299.41" width="35.334" height="20"/><rect x="294.994" y="299.41" width="35.333" height="20"/></g></g></g></svg>`,
            url: "categories",
            img: "/file/download (2).jfif",
            parent: null,
            slider: 1,
            home: null,
          },
          brand: {
            name: "کالای صنعتی محمودی",
            logo: "./file/download.jfif",
            link: "/company/1",
          },
          min: 10,
        },
        {
          id: 1,
          title: "گیوتین قیچی خم کن",
          img: "/file/img_35360_1.jpg",
          price: "175000000",
          category: {
            id: 14,
            title: "تجهیزات و ماشین آلات صنعتی",
            icon: `<svg version="1.1" id="Layer_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink"  viewBox="0 0 384.154 384.154" xml:space="preserve"><g id="XMLID_999_"><g><g><path d="M334.154,259.41h-17.077v-37.863h-60v37.863h-49.25v-37.863h-60v37.863h-52.75V66.744h52.359 c3.171,9.612,10.779,17.22,20.391,20.391v27.472h-8.664l-0.768,31.698l-34.104,22.839l22.054,31.178l16.328-11.551 l-10.205-14.426l25.358-16.981l25.358,16.981l-10.205,14.426l16.328,11.551l22.055-31.178l-34.104-22.839l-0.768-31.698h-8.664 V87.135c12.761-4.21,22-16.239,22-30.391c0-17.645-14.355-32-32-32c-14.153,0-26.181,9.239-30.391,22H95.077H72.494H30.077 v216.818C12.395,271.276,0,288.919,0,309.41c0,27.57,22.43,50,50,50h284.154c27.57,0,50-22.43,50-50 S361.725,259.41,334.154,259.41z M177.827,44.744c6.617,0,12,5.383,12,12s-5.383,12-12,12s-12-5.383-12-12 S171.21,44.744,177.827,44.744z M277.077,241.547h20v17.863h-20V241.547z M167.827,241.547h20v17.863h-20V241.547z M50.077,66.744h22.417h2.583V259.41h-25V66.744z M334.154,339.41H50c-16.542,0-30-13.458-30-30s13.458-30,30-30h284.154 c16.542,0,30,13.458,30,30S350.696,339.41,334.154,339.41z"/><rect x="53.827" y="299.41" width="35.333" height="20"/><rect x="134.216" y="299.41" width="35.333" height="20"/><rect x="214.604" y="299.41" width="35.334" height="20"/><rect x="294.994" y="299.41" width="35.333" height="20"/></g></g></g></svg>`,
            url: "categories",
            img: "/file/download (2).jfif",
            parent: null,
            slider: 1,
            home: null,
          },
          brand: {
            name: "کالای صنعتی محمودی",
            logo: "./file/download.jfif",
            link: "/company/1",
          },
          min: 1,
        },
      ],
    },
    {
      id: 1,
      title: "شرکت افرا",
      img: "/file/انواع-دستکش-در-تجهیزات-پزشکی.jpg",
      category: {
        id: 14,
        title: "تجهیزات و ماشین آلات صنعتی",
        icon: `<svg version="1.1" id="Layer_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink"  viewBox="0 0 384.154 384.154" xml:space="preserve"><g id="XMLID_999_"><g><g><path d="M334.154,259.41h-17.077v-37.863h-60v37.863h-49.25v-37.863h-60v37.863h-52.75V66.744h52.359 c3.171,9.612,10.779,17.22,20.391,20.391v27.472h-8.664l-0.768,31.698l-34.104,22.839l22.054,31.178l16.328-11.551 l-10.205-14.426l25.358-16.981l25.358,16.981l-10.205,14.426l16.328,11.551l22.055-31.178l-34.104-22.839l-0.768-31.698h-8.664 V87.135c12.761-4.21,22-16.239,22-30.391c0-17.645-14.355-32-32-32c-14.153,0-26.181,9.239-30.391,22H95.077H72.494H30.077 v216.818C12.395,271.276,0,288.919,0,309.41c0,27.57,22.43,50,50,50h284.154c27.57,0,50-22.43,50-50 S361.725,259.41,334.154,259.41z M177.827,44.744c6.617,0,12,5.383,12,12s-5.383,12-12,12s-12-5.383-12-12 S171.21,44.744,177.827,44.744z M277.077,241.547h20v17.863h-20V241.547z M167.827,241.547h20v17.863h-20V241.547z M50.077,66.744h22.417h2.583V259.41h-25V66.744z M334.154,339.41H50c-16.542,0-30-13.458-30-30s13.458-30,30-30h284.154 c16.542,0,30,13.458,30,30S350.696,339.41,334.154,339.41z"/><rect x="53.827" y="299.41" width="35.333" height="20"/><rect x="134.216" y="299.41" width="35.333" height="20"/><rect x="214.604" y="299.41" width="35.334" height="20"/><rect x="294.994" y="299.41" width="35.333" height="20"/></g></g></g></svg>`,
        url: "categories",
        img: "/file/download (2).jfif",
        parent: null,
        slider: 1,
        home: null,
      },
      logo: "./file/download1.jfif",
      phone: "09146003002",
      addres: "موقعیت مکانی فروشگاه",
      status: 0,
      product: [
        {
          id: 1,
          title: "چانه گرد کن مخروطی تمام اتوماتیک حرفه ای",
          img: "/file/110732667.webp",
          price: "2000000",
          lastPrice: null,
          category: {
            id: 14,
            title: "تجهیزات و ماشین آلات صنعتی",
            icon: `<svg version="1.1" id="Layer_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" 
            viewBox="0 0 384.154 384.154" xml:space="preserve">
         <g id="XMLID_999_">
           <g>
             <g>
               <path d="M334.154,259.41h-17.077v-37.863h-60v37.863h-49.25v-37.863h-60v37.863h-52.75V66.744h52.359
                 c3.171,9.612,10.779,17.22,20.391,20.391v27.472h-8.664l-0.768,31.698l-34.104,22.839l22.054,31.178l16.328-11.551
                 l-10.205-14.426l25.358-16.981l25.358,16.981l-10.205,14.426l16.328,11.551l22.055-31.178l-34.104-22.839l-0.768-31.698h-8.664
                 V87.135c12.761-4.21,22-16.239,22-30.391c0-17.645-14.355-32-32-32c-14.153,0-26.181,9.239-30.391,22H95.077H72.494H30.077
                 v216.818C12.395,271.276,0,288.919,0,309.41c0,27.57,22.43,50,50,50h284.154c27.57,0,50-22.43,50-50
                 S361.725,259.41,334.154,259.41z M177.827,44.744c6.617,0,12,5.383,12,12s-5.383,12-12,12s-12-5.383-12-12
                 S171.21,44.744,177.827,44.744z M277.077,241.547h20v17.863h-20V241.547z M167.827,241.547h20v17.863h-20V241.547z
                  M50.077,66.744h22.417h2.583V259.41h-25V66.744z M334.154,339.41H50c-16.542,0-30-13.458-30-30s13.458-30,30-30h284.154
                 c16.542,0,30,13.458,30,30S350.696,339.41,334.154,339.41z"/>
               <rect x="53.827" y="299.41" width="35.333" height="20"/>
               <rect x="134.216" y="299.41" width="35.333" height="20"/>
               <rect x="214.604" y="299.41" width="35.334" height="20"/>
               <rect x="294.994" y="299.41" width="35.333" height="20"/>
             </g>
           </g>
         </g>
         </svg>`,
            url: "categories",
            img: "/file/download (2).jfif",
            parent: null,
            slider: 1,
            home: null,
          },
          brand: {
            name: "شرکت پاک اندیشان",
            logo: "./file/kala.jfif",
            link: "/company/1",
          },
          min: 2,
        },
        {
          id: 1,
          title: "اسیاب ۰۲۱ و ماشین اسپرسو اسکاسو",
          img: "/file/img_35777_1.jpg",
          price: "40000000",
          lastPrice: null,
          category: {
            id: 14,
            title: "تجهیزات و ماشین آلات صنعتی",
            icon: `<svg version="1.1" id="Layer_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink"  viewBox="0 0 384.154 384.154" xml:space="preserve"><g id="XMLID_999_"><g><g><path d="M334.154,259.41h-17.077v-37.863h-60v37.863h-49.25v-37.863h-60v37.863h-52.75V66.744h52.359 c3.171,9.612,10.779,17.22,20.391,20.391v27.472h-8.664l-0.768,31.698l-34.104,22.839l22.054,31.178l16.328-11.551 l-10.205-14.426l25.358-16.981l25.358,16.981l-10.205,14.426l16.328,11.551l22.055-31.178l-34.104-22.839l-0.768-31.698h-8.664 V87.135c12.761-4.21,22-16.239,22-30.391c0-17.645-14.355-32-32-32c-14.153,0-26.181,9.239-30.391,22H95.077H72.494H30.077 v216.818C12.395,271.276,0,288.919,0,309.41c0,27.57,22.43,50,50,50h284.154c27.57,0,50-22.43,50-50 S361.725,259.41,334.154,259.41z M177.827,44.744c6.617,0,12,5.383,12,12s-5.383,12-12,12s-12-5.383-12-12 S171.21,44.744,177.827,44.744z M277.077,241.547h20v17.863h-20V241.547z M167.827,241.547h20v17.863h-20V241.547z M50.077,66.744h22.417h2.583V259.41h-25V66.744z M334.154,339.41H50c-16.542,0-30-13.458-30-30s13.458-30,30-30h284.154 c16.542,0,30,13.458,30,30S350.696,339.41,334.154,339.41z"/><rect x="53.827" y="299.41" width="35.333" height="20"/><rect x="134.216" y="299.41" width="35.333" height="20"/><rect x="214.604" y="299.41" width="35.334" height="20"/><rect x="294.994" y="299.41" width="35.333" height="20"/></g></g></g></svg>`,
            url: "categories",
            img: "/file/download (2).jfif",
            parent: null,
            slider: 1,
            home: null,
          },
          brand: {
            name: "کالای صنعتی محمودی",
            logo: "./file/download.jfif",
            link: "/company/1",
          },
          min: 2,
        },
        {
          id: 1,
          title: "پنل خورشیدی المانی ",
          img: "/file/img_35761_1.jpg",
          price: "550000",
          lastPrice: "500000",
          category: {
            id: 14,
            title: "تجهیزات و ماشین آلات صنعتی",
            icon: `<svg version="1.1" id="Layer_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink"  viewBox="0 0 384.154 384.154" xml:space="preserve"><g id="XMLID_999_"><g><g><path d="M334.154,259.41h-17.077v-37.863h-60v37.863h-49.25v-37.863h-60v37.863h-52.75V66.744h52.359 c3.171,9.612,10.779,17.22,20.391,20.391v27.472h-8.664l-0.768,31.698l-34.104,22.839l22.054,31.178l16.328-11.551 l-10.205-14.426l25.358-16.981l25.358,16.981l-10.205,14.426l16.328,11.551l22.055-31.178l-34.104-22.839l-0.768-31.698h-8.664 V87.135c12.761-4.21,22-16.239,22-30.391c0-17.645-14.355-32-32-32c-14.153,0-26.181,9.239-30.391,22H95.077H72.494H30.077 v216.818C12.395,271.276,0,288.919,0,309.41c0,27.57,22.43,50,50,50h284.154c27.57,0,50-22.43,50-50 S361.725,259.41,334.154,259.41z M177.827,44.744c6.617,0,12,5.383,12,12s-5.383,12-12,12s-12-5.383-12-12 S171.21,44.744,177.827,44.744z M277.077,241.547h20v17.863h-20V241.547z M167.827,241.547h20v17.863h-20V241.547z M50.077,66.744h22.417h2.583V259.41h-25V66.744z M334.154,339.41H50c-16.542,0-30-13.458-30-30s13.458-30,30-30h284.154 c16.542,0,30,13.458,30,30S350.696,339.41,334.154,339.41z"/><rect x="53.827" y="299.41" width="35.333" height="20"/><rect x="134.216" y="299.41" width="35.333" height="20"/><rect x="214.604" y="299.41" width="35.334" height="20"/><rect x="294.994" y="299.41" width="35.333" height="20"/></g></g></g></svg>`,
            url: "categories",
            img: "/file/download (2).jfif",
            parent: null,
            slider: 1,
            home: null,
          },
          brand: {
            name: "کالای صنعتی محمودی",
            logo: "./file/download1.jfif",
            link: "/company/1",
          },
          min: 1,
        },
      ],
    },
    {
      id: 1,
      title: "تهران صنعت",
      img: "/file/caspian-plant-9.jpg",
      category: {
        id: 14,
        title: "تجهیزات و ماشین آلات صنعتی",
        icon: `<svg version="1.1" id="Layer_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink"  viewBox="0 0 384.154 384.154" xml:space="preserve"><g id="XMLID_999_"><g><g><path d="M334.154,259.41h-17.077v-37.863h-60v37.863h-49.25v-37.863h-60v37.863h-52.75V66.744h52.359 c3.171,9.612,10.779,17.22,20.391,20.391v27.472h-8.664l-0.768,31.698l-34.104,22.839l22.054,31.178l16.328-11.551 l-10.205-14.426l25.358-16.981l25.358,16.981l-10.205,14.426l16.328,11.551l22.055-31.178l-34.104-22.839l-0.768-31.698h-8.664 V87.135c12.761-4.21,22-16.239,22-30.391c0-17.645-14.355-32-32-32c-14.153,0-26.181,9.239-30.391,22H95.077H72.494H30.077 v216.818C12.395,271.276,0,288.919,0,309.41c0,27.57,22.43,50,50,50h284.154c27.57,0,50-22.43,50-50 S361.725,259.41,334.154,259.41z M177.827,44.744c6.617,0,12,5.383,12,12s-5.383,12-12,12s-12-5.383-12-12 S171.21,44.744,177.827,44.744z M277.077,241.547h20v17.863h-20V241.547z M167.827,241.547h20v17.863h-20V241.547z M50.077,66.744h22.417h2.583V259.41h-25V66.744z M334.154,339.41H50c-16.542,0-30-13.458-30-30s13.458-30,30-30h284.154 c16.542,0,30,13.458,30,30S350.696,339.41,334.154,339.41z"/><rect x="53.827" y="299.41" width="35.333" height="20"/><rect x="134.216" y="299.41" width="35.333" height="20"/><rect x="214.604" y="299.41" width="35.334" height="20"/><rect x="294.994" y="299.41" width="35.333" height="20"/></g></g></g></svg>`,
        url: "categories",
        img: "/file/download (2).jfif",
        parent: null,
        slider: 1,
        home: null,
      },
      logo: "./file/بببببب.jfif",
      phone: "09146003002",
      addres: "موقعیت مکانی فروشگاه",
      status: 1,
      product: [
        {
          id: 1,
          title: "الکتروموتور چینی سه فاز و تکفاز گیربکس حلزونی ",
          img: "/file/img_34441_1.jpg",
          price: "2000000",
          category: {
            id: 14,
            title: "تجهیزات و ماشین آلات صنعتی",
            icon: `<svg version="1.1" id="Layer_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink"  viewBox="0 0 384.154 384.154" xml:space="preserve"><g id="XMLID_999_"><g><g><path d="M334.154,259.41h-17.077v-37.863h-60v37.863h-49.25v-37.863h-60v37.863h-52.75V66.744h52.359 c3.171,9.612,10.779,17.22,20.391,20.391v27.472h-8.664l-0.768,31.698l-34.104,22.839l22.054,31.178l16.328-11.551 l-10.205-14.426l25.358-16.981l25.358,16.981l-10.205,14.426l16.328,11.551l22.055-31.178l-34.104-22.839l-0.768-31.698h-8.664 V87.135c12.761-4.21,22-16.239,22-30.391c0-17.645-14.355-32-32-32c-14.153,0-26.181,9.239-30.391,22H95.077H72.494H30.077 v216.818C12.395,271.276,0,288.919,0,309.41c0,27.57,22.43,50,50,50h284.154c27.57,0,50-22.43,50-50 S361.725,259.41,334.154,259.41z M177.827,44.744c6.617,0,12,5.383,12,12s-5.383,12-12,12s-12-5.383-12-12 S171.21,44.744,177.827,44.744z M277.077,241.547h20v17.863h-20V241.547z M167.827,241.547h20v17.863h-20V241.547z M50.077,66.744h22.417h2.583V259.41h-25V66.744z M334.154,339.41H50c-16.542,0-30-13.458-30-30s13.458-30,30-30h284.154 c16.542,0,30,13.458,30,30S350.696,339.41,334.154,339.41z"/><rect x="53.827" y="299.41" width="35.333" height="20"/><rect x="134.216" y="299.41" width="35.333" height="20"/><rect x="214.604" y="299.41" width="35.334" height="20"/><rect x="294.994" y="299.41" width="35.333" height="20"/></g></g></g></svg>`,
            url: "categories",
            img: "/file/download (2).jfif",
            parent: null,
            slider: 1,
            home: null,
          },
          brand: {
            name: "کالای صنعتی محمودی",
            logo: "./file/download1.jfif",
            link: "/company/1",
          },
          min: 2,
        },

        {
          id: 1,
          title: "کوره هوای گرم",
          img: "/file/img_35734_1.jpg",
          price: "1520000",
          category: {
            id: 14,
            title: "تجهیزات و ماشین آلات صنعتی",
            icon: `<svg version="1.1" id="Layer_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink"  viewBox="0 0 384.154 384.154" xml:space="preserve"><g id="XMLID_999_"><g><g><path d="M334.154,259.41h-17.077v-37.863h-60v37.863h-49.25v-37.863h-60v37.863h-52.75V66.744h52.359 c3.171,9.612,10.779,17.22,20.391,20.391v27.472h-8.664l-0.768,31.698l-34.104,22.839l22.054,31.178l16.328-11.551 l-10.205-14.426l25.358-16.981l25.358,16.981l-10.205,14.426l16.328,11.551l22.055-31.178l-34.104-22.839l-0.768-31.698h-8.664 V87.135c12.761-4.21,22-16.239,22-30.391c0-17.645-14.355-32-32-32c-14.153,0-26.181,9.239-30.391,22H95.077H72.494H30.077 v216.818C12.395,271.276,0,288.919,0,309.41c0,27.57,22.43,50,50,50h284.154c27.57,0,50-22.43,50-50 S361.725,259.41,334.154,259.41z M177.827,44.744c6.617,0,12,5.383,12,12s-5.383,12-12,12s-12-5.383-12-12 S171.21,44.744,177.827,44.744z M277.077,241.547h20v17.863h-20V241.547z M167.827,241.547h20v17.863h-20V241.547z M50.077,66.744h22.417h2.583V259.41h-25V66.744z M334.154,339.41H50c-16.542,0-30-13.458-30-30s13.458-30,30-30h284.154 c16.542,0,30,13.458,30,30S350.696,339.41,334.154,339.41z"/><rect x="53.827" y="299.41" width="35.333" height="20"/><rect x="134.216" y="299.41" width="35.333" height="20"/><rect x="214.604" y="299.41" width="35.334" height="20"/><rect x="294.994" y="299.41" width="35.333" height="20"/></g></g></g></svg>`,
            url: "categories",
            img: "/file/download (2).jfif",
            parent: null,
            slider: 1,
            home: null,
          },
          brand: {
            name: "کالای صنعتی محمودی",
            logo: "./file/download.jfif",
            link: "/company/1",
          },
          min: 10,
        },
        {
          id: 1,
          title: "اسیاب ۰۲۱ و ماشین اسپرسو اسکاسو",
          img: "/file/img_35777_1.jpg",
          price: "40000000",
          lastPrice: null,
          category: {
            id: 14,
            title: "تجهیزات و ماشین آلات صنعتی",
            icon: `<svg version="1.1" id="Layer_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink"  viewBox="0 0 384.154 384.154" xml:space="preserve"><g id="XMLID_999_"><g><g><path d="M334.154,259.41h-17.077v-37.863h-60v37.863h-49.25v-37.863h-60v37.863h-52.75V66.744h52.359 c3.171,9.612,10.779,17.22,20.391,20.391v27.472h-8.664l-0.768,31.698l-34.104,22.839l22.054,31.178l16.328-11.551 l-10.205-14.426l25.358-16.981l25.358,16.981l-10.205,14.426l16.328,11.551l22.055-31.178l-34.104-22.839l-0.768-31.698h-8.664 V87.135c12.761-4.21,22-16.239,22-30.391c0-17.645-14.355-32-32-32c-14.153,0-26.181,9.239-30.391,22H95.077H72.494H30.077 v216.818C12.395,271.276,0,288.919,0,309.41c0,27.57,22.43,50,50,50h284.154c27.57,0,50-22.43,50-50 S361.725,259.41,334.154,259.41z M177.827,44.744c6.617,0,12,5.383,12,12s-5.383,12-12,12s-12-5.383-12-12 S171.21,44.744,177.827,44.744z M277.077,241.547h20v17.863h-20V241.547z M167.827,241.547h20v17.863h-20V241.547z M50.077,66.744h22.417h2.583V259.41h-25V66.744z M334.154,339.41H50c-16.542,0-30-13.458-30-30s13.458-30,30-30h284.154 c16.542,0,30,13.458,30,30S350.696,339.41,334.154,339.41z"/><rect x="53.827" y="299.41" width="35.333" height="20"/><rect x="134.216" y="299.41" width="35.333" height="20"/><rect x="214.604" y="299.41" width="35.334" height="20"/><rect x="294.994" y="299.41" width="35.333" height="20"/></g></g></g></svg>`,
            url: "categories",
            img: "/file/download (2).jfif",
            parent: null,
            slider: 1,
            home: null,
          },
          brand: {
            name: "کالای صنعتی محمودی",
            logo: "./file/download.jfif",
            link: "/company/1",
          },
          min: 2,
        },
      ],
    },
    {
      id: 1,
      title: "عبیدی",
      img: "/file/hr.webp",
      category: {
        id: 14,
        title: "تجهیزات و ماشین آلات صنعتی",
        icon: `<svg version="1.1" id="Layer_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink"  viewBox="0 0 384.154 384.154" xml:space="preserve"><g id="XMLID_999_"><g><g><path d="M334.154,259.41h-17.077v-37.863h-60v37.863h-49.25v-37.863h-60v37.863h-52.75V66.744h52.359 c3.171,9.612,10.779,17.22,20.391,20.391v27.472h-8.664l-0.768,31.698l-34.104,22.839l22.054,31.178l16.328-11.551 l-10.205-14.426l25.358-16.981l25.358,16.981l-10.205,14.426l16.328,11.551l22.055-31.178l-34.104-22.839l-0.768-31.698h-8.664 V87.135c12.761-4.21,22-16.239,22-30.391c0-17.645-14.355-32-32-32c-14.153,0-26.181,9.239-30.391,22H95.077H72.494H30.077 v216.818C12.395,271.276,0,288.919,0,309.41c0,27.57,22.43,50,50,50h284.154c27.57,0,50-22.43,50-50 S361.725,259.41,334.154,259.41z M177.827,44.744c6.617,0,12,5.383,12,12s-5.383,12-12,12s-12-5.383-12-12 S171.21,44.744,177.827,44.744z M277.077,241.547h20v17.863h-20V241.547z M167.827,241.547h20v17.863h-20V241.547z M50.077,66.744h22.417h2.583V259.41h-25V66.744z M334.154,339.41H50c-16.542,0-30-13.458-30-30s13.458-30,30-30h284.154 c16.542,0,30,13.458,30,30S350.696,339.41,334.154,339.41z"/><rect x="53.827" y="299.41" width="35.333" height="20"/><rect x="134.216" y="299.41" width="35.333" height="20"/><rect x="214.604" y="299.41" width="35.334" height="20"/><rect x="294.994" y="299.41" width="35.333" height="20"/></g></g></g></svg>`,
        url: "categories",
        img: "/file/download (2).jfif",
        parent: null,
        slider: 1,
        home: null,
      },
      logo: "./file/download.png",
      phone: "09146003002",
      addres: "موقعیت مکانی فروشگاه",
      status: 0,
      product: [
        {
          img: "./file/img_35406_1.jpg",
          link: "/",
          title: "تراش اونیورسال TN۵۰BR۲۰۰۰",
        },
        {
          img: "./file/img_35404_1.jpg",
          link: "/",
          title: "ماشین VMC۸۵۰",
        },
        {
          img: "./file/img_35171_1.jpg",
          link: "/",
          title: "دستگاه فایبر مارکینگ فلزات",
        },
      ],
    },
  ];

  const blog = [
    {
      img: "/file/the-positive-link.jpg",
      title: "اوج‌گیری کولرگازی در گرم‌ترین تابستان تاریخ",
      id: 1,
      dsc: "گرمای شدید و خشکسالی در ایران باعث شده است که مصرف برق به رکوردی جدید برسد کولرگازی یکی از عوامل اصلی افزایش تقاضاست که نه تنها هزینه های انرژی را بالا می برد بلکه آلودگی هوا را هم تشدید می کند",
      date: "2023-11-12T08:39:24.000Z",
    },
    {
      img: "/file/B04A7880.jfif",
      title: "پلی‌استیشن ۴ و فری‌فایر",
      id: 1,
      dsc: "پلی‌استیشن ۴ یک کنسول بازی است که توسط شرکت سونی ساخته شده است فری‌فایر یک بازی آنلاین است که در سبک بقا و تیراندازی اول شخص است این بازی روی پلی‌استیشن ۴ قابل اجرا است و می توانید با دوستان خود بازی کنید این بازی بسیار محبوب و هیجان انگیز است و بیش از ۵۰۰ میلیون بار دانلود شده است",
      date: "2023-11-11T08:39:24.000Z",
    },
    {
      img: "/file/B04A7006.jfif",
      title: "کرمانشاه، البرز و همدان؛ دوچرخه‌بازترین مردم ایران",
      id: 1,
      dsc: "دوچرخه‌سواری یکی از ورزش های سالم و محبوب است که برای بدن و ذهن مفید است به گزارش [سایت خبری]، بر اساس آمار سازمان ورزش و جوانان، سه استان کرمانشاه، البرز و همدان بیشترین تعداد دوچرخه‌بازان را در کشور دارند این سه استان با داشتن زیرساخت های مناسب، مسیرهای زیبا و فرهنگ دوچرخه‌سواری، مردم را به این ورزش",
      date: "2023-11-09T08:39:24.000Z",
    },
  ];
  return (
    <div className={"position-relative " + (siteData.dir ? siteData.dir : "")}>
      <Head>
        <title>
          {page && page.title ? page.title + " | " : ""}
          {siteData && siteData.title ? siteData.title : ""}
        </title>
        <meta
          name="description"
          content={siteData && siteData.descripton ? siteData.descripton : ""}
        />
        <meta
          name="keywords"
          content={
            siteData &&
            siteData.metaKeywords &&
            siteData.metaKeywords.map((item) => item)
          }
        />
        <link rel="icon" href={siteData.favIcone} />
      </Head>
      <Helmet>
        <body data-bs-theme={siteData.theme} />
      </Helmet>
      <div className="main">
        <Menu content={siteData.menu} fixed={"fixed"} />
        <Slider content={slider} category={siteData.category} />

        <CategoresRow
          content={category.filter((i) => i.language_id == "3")}
          title={"دسته بندی"}
        />

        <CenterRow
          content={states.filter((i) => i.image != "" && i.language_id == "3")}
          title={"استان ها"}
        />

        <ActivistsRow
          content={booths.filter((i) => i.language == "فارسی")}
          title={"غرفه ها"}
          dsc={"لیست فروشگاه ها و ارائه دهندگان خدمات"}
          bg={"./file/bgrow.jpg"}
        />
        <div className="container" style={{ paddingBlock: "50px" }}>
          <div className="row">
            <div className="col-12  mb-4">
              <h2 className="h4">محصولات</h2>
              <div
                className="d-flex"
                style={{ justifyContent: "space-between" }}
              >
                <div>
                  <p>خریدی به صرفه و مطمئن</p>
                </div>
                <a
                  href={
                    siteData.urls && siteData.urls.supports
                      ? siteData.urls.products
                      : ""
                  }
                  className=" more"
                >
                  موارد بیشتر
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    id="Outline"
                    viewBox="0 0 24 24"
                    width="18"
                    height="18"
                  >
                    <path d="M10.6,12.71a1,1,0,0,1,0-1.42l4.59-4.58a1,1,0,0,0,0-1.42,1,1,0,0,0-1.41,0L9.19,9.88a3,3,0,0,0,0,4.24l4.59,4.59a1,1,0,0,0,.7.29,1,1,0,0,0,.71-.29,1,1,0,0,0,0-1.42Z"></path>
                  </svg>
                </a>
              </div>
            </div>
          </div>
          <div className="row g-4">
            {products &&
              products
                .filter((i) => i.language == "فارسی")
                .map((item, i) => (
                  <div key={i} className="col-lg-3 col-md-4 col-6">
                    <Box dir={siteData.dir} content={item} i={i} />
                  </div>
                ))}
          </div>
        </div>
        <Banner content={banner} siteData={siteData} />
        <BlogRow
          content={blogs.filter((i) => i.language == "فارسی")}
          title={"وبلاگ"}
        />
        {/* {category ? (
          <div
            className="container"
            style={{ paddingBottom: "50px", paddingTop: "10px" }}
          >
            <div className="row">
              <h2 className="h4 mb-2">دسته بندی های دارای محصول جدید</h2>
              <div className="row g-3">
                <div className="col-lg-2 col-md-3 col-6">
                  <a href="" className="hovercolor">
                    همه محصولات (307)
                  </a>
                </div>
                {siteData.category &&
                  siteData.category.map((item, i) => (
                    <div className="col-lg-2 col-md-3 col-6" key={i}>
                      <a href="/" className="hovercolor">
                        {item.title ? item.title : ""}
                      </a>
                    </div>
                  ))}
              </div>
            </div>
          </div>
        ) : (
          ""
        )} */}
        <Footer content={siteData.footer} />
      </div>
      <style jsx>{`
        .hovercolor:hover {
          color: var(--color1) !important;
        }
        .banners {
          padding-block: 50px;
        }
        .box {
          box-shadow: var(--bs-box-shadow);
          height: calc(35vh - var(--bs-gutter-y) / 2);
          max-height: calc(616px - var(--bs-gutter-y) / 2);
          border-radius: var(--bs-border-radius);
          background-size: cover !important;
          background-position: center !important;
        }
        .main {
          background: var(--bs-tertiary-bg);
          min-height: 100vh;
        }
      `}</style>
    </div>
  );
};

export default Index;
